Item{
  id: faq;
  x: 300;
  y: 80;
  width: 500;
  height: 500;
  visible: false;
ScrollingText {
        id: descriptionText;

        anchors.left: parent.left;
        anchors.top: parent.top;
        anchors.right: parent.right;
        anchors.bottom: parent.bottom;
        color: "#FFFFFF";
        font: secondaryFont;
        text: "Для многих людей время враг. Тревога, вызванная «тикающими часами» обычно в момент приближения дедлайна, ведет к неэффективности работы и учебы, что в свою очередь влечет за собой тенденцию к откладыванию дел «на потом». Используя технику Pomodoro, вы увеличиваете свою продуктивность, делая больше за меньшее время.

Техника Pomodoro позволяет быть на максимуме своей эффективности, не перегружать себя. Также позволяет сконцентрироваться над определенной задачей, позволяет решить ее в более короткий промежуток времени чем, если бы решалось несколько задач одновременно.;

Данное приложение имеет весь функционал позволяющий Вам организовывать свое рабочее время в соответствии с вышеописанной техникой. У Вас есть возможность настраивать гибкий график рабочего процесса с помощью настроект таймера, а также Вы можете сами назначать время для отдаха. В арсенале функционала приложения имеетются такие полезные функции как:

  1) Создание новой задачи;
  2) Удаление задачи;
  3) Редактирование задачи;
  4) Пометить задачу как выполненную;
  5) Убрать из списка выполненных;
  6) Настроить время рабочего процесса;
  7) Настроить время отдыха;
  8) Выбрать одну из четырех тем оформления фона;

Интерфейс приложения Pomodoro можно условно разделить на три основных части:

1)  Меню персонализации и помощи (Левая область приложения).

Данная область управления позволяет Вам менять цветовую тему приложения. Для этого достаточно активировать одну из четырех круглых кнопок в левой части экрана, каждая из которых отличается цветом (синяя/желтая/черная/красная).

По-мимо этого в этой же части экрана у Вас есть возможность выбрать звук увидомления для Вашего таймера, который будет воспроизводиться после окончания таймера рабочего процесса.

Под кнопкой выбора звука, распологается кнопка настроек таймера. Тут, благодаря гибким настройками времени, Вы всегда можете настроить длительность рабочего процесса, перерыва и времени длительного отдыха.

Еще ниже, нажав на иконку вопросительного знака, Вы всегда можете прочесть этот FAQ если что-то забыли.

2)  Область таймера (Центральная область приложения).

Данная область представляет из себя круглый белый таймер на котором Вы можете видеть непосредственно сам таймер и активное состояние. Таймер может находиться в фазе 'Работа', либо в фазе 'Отдых'.
Внизу самого таймера распологаются 2 клавиши управления этим таймером, каждая из этих клавишь имеет свой функционал. Так например, самая центральная кнопка выполняет старт/паузу отсчета времени, эта кнопка основная в ходе использования таймера. С помощью нее Вы и запускаете таймер на обратный отсчет, а если нужно то ставите на паузу. Правее распологается клавиша сброса таймера. Функционал данной клавиши отвечает за сброс времени в исходное состоние до момента запуска таймера, то есть если на таймере до момента запуска было 25 минут и Вы запустили таймер случайно, то Вы можете не отменять работу таймера, а вернуть его в исходное состояние 25 минут.

3) Область управления задачами (Правая область приложения).

В правой части интерфейса приложения Вы можете видеть меню управления Вашими задачами. С помощью этого меню Вы собственно и создаете все Ваши задачи, которые нацелены решить с помощью нашего приложения. Так в верхней части Вы можете наблюдать клавишу 'Добавить', нажав на которую перед Вами появится окно создания задачи. Далее в этом окне создания задачи, заполните заголовок задачи и напишите описание того, что Вы намерены делать, а после подтвердите сохранение задачи в общий список задач. После того как Вы создадите нужное Вам количество интересующих Вас задач, все они будут распологаться в списке задач, который по мере заполнения можно пролистывать. Для того что бы начать работать с конкретной задачей ее нужно выбрать. Для этого выберите нужную задачу из списка задач и подтвердите выбор нажав 'ОК', после этого выбранная Вами задача окажется снизу относительно таймера и кнопок управления им. Далее Вам остается запустить таймер, как это было описано выше, и на протяжении всего рабочего процесса Вы сможете видеть текущую задачу с назанием и описанием того, что нужно сделать, внизу таймера. После того как истечет время рабочего процесса, наступит фаза отдыха. В Вашем праве как поступить далее, а именно, Вы можете сменить текущую задачу и начать новую рабочую фазу с новой задачей. Либо продолжать работу с текущей задачей если, к примеру Вы не успели ее доделать.

В ситуации когда текущая задача выполнена, ее нужно пометить как сделанную. Для этого Вам нужно выбрать эту задачу в списке задач и нажать на 'Зеленую кнопку/F2', после этого задача которую Вы выбрали отметится зеленым кружком и отсортируется вниз всего списка задач. Точно так же Вы можете отменить отмеченную ранее выполненную задачу, если Вы пометили ее случайно или Вам нужно ее доделать. По-мимо этого Вы можете стокнуться с ситуацией, когда нужно отредактировать какую-либо задачу в списке всех задач. Для этого Вы должны выбрать интересующую Вас задачу в общем списке задач и нажать на 'Желтую кнопку/F3', после чего перед Вами появится окно редактирования задачи. Отредактировав, подтвердите редактирование нажав на 'Сохранить', после чего обновленная задача снова появится у Вас в списке всех задач. Также у Вас может возникнуть нужда в том, чтобы удалить задачу, например если она не нужна или все задачи выполнены и их надо почистить. Для этого опять же стоит выбрать нужну задачу из общего списка задач, а после этого нажать на 'Красную кнопку/F1'. После это подтвердите удаление в появившемся окне.

В самом низу правого меню распологается кнопка 'История'. Нажав на эту кнопку Вы можете просмотреть статистику Вашего рабочего процесса в виде диаграммы зависимости количества рабочих циклов от дня, которые откроются в новом окне. Количество рабочих циклов - это количество истекших таймеров в фазе рабочего процесса. То есть если Вы, в ходе своей рабочей деятельности запустили таймер, к примеру по 25 минут каждый, и проработали все эти два раза до момента истечения таймера, то общее количество рабочих циклов за день будет ровняться 2. Это количество рабочих циклов и отразится в диаграмме, которая строится за 1 день, неделю и месяц.

Справа от диаграммы распологается список всех выполенных задач. Что бы вести учет выполненных задач, Вам нужно выполнить поставленную задачу из списка задач, после чего пометить ее как 'выполненную' и удалить из списка задач. После этого задача окажится в списке выполненных задач.
Так же Вы можете всегда просмотреть что именно Вы делали в той или иной задаче, выбрав ее из списка выполненных задач и прочитать о ее описании, внизу диаграммы.


Это приложение было сделано в рамках III Всероссийского конкурса «Программируй будущее» командой Wassup_Team. Наши контакты:

    Василенко Сергей
    ВК: https://vk.com/eazy___s
    Email: Mikki.solid@yandex.ru;

    Семенов Евгений
    ВК: https://vk.com/geekachan
    Email: semunoff90@gmail.com;

    Корепанов Андрей
    ВК: https://vk.com/mechanic1197
    Email: mopsplaytheme@mail.ru.

    Спасибо за внимание!";

        onDownPressed: {
          okay.setFocus();
        }
    }

    Button{
      id: okay;
      width: 150;
      height: 50;
      radius: 5;
      anchors.horizontalCenter: descriptionText.horizontalCenter;
      anchors.top: descriptionText.bottom;
      anchors.topMargin: 25;
      text: "Понятно";

      onUpPressed: {
        descriptionText.setFocus();
      }

      onSelectPressed: {
        faq.visible = false;
        casetimer.visible = true;
        activeTask.visible = true;
        musicButton.opacity = 1;
        redButton.opacity = 1;
        yellowButton.opacity = 1;
        blueButton.opacity = 1;
        faqButton.opacity = 1;
        rightMenu.opacity = 1;
        settingButton.opacity = 1;
      }
    }
}
